basecamp/app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["description", "project description"], ["updated_at", "2018-01-18 17:17:10.190268"], ["id", 1]]
---
	def update
		@project = Project.find(params[:id])
		if @project.update_attributes(project_params)